In [16]:
import pandas as pd
import numpy as np

"Advertising.csv"

i) Read the dataset "Advertising.csv" in data frame.

In [17]:
df= pd.read_csv("Advertising.csv")
df

        TV  radio  newspaper  sales
0    230.1   37.8       69.2   22.1
1     44.5   39.3       45.1   10.4
2     17.2   45.9       69.3    9.3
3    151.5   41.3       58.5   18.5
4    180.8   10.8       58.4   12.9
..     ...    ...        ...    ...
195   38.2    3.7       13.8    7.6
196   94.2    4.9        8.1    9.7
197  177.0    9.3        6.4   12.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   13.4

[200 rows x 4 columns]

ii) Print first five records of dataset.

In [18]:
df.head(5)

      TV  radio  newspaper  sales
0  230.1   37.8       69.2   22.1
1   44.5   39.3       45.1   10.4
2   17.2   45.9       69.3    9.3
3  151.5   41.3       58.5   18.5
4  180.8   10.8       58.4   12.9

iii) print last five records from dataset.

In [19]:
df.tail(5)

        TV  radio  newspaper  sales
195   38.2    3.7       13.8    7.6
196   94.2    4.9        8.1    9.7
197  177.0    9.3        6.4   12.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   13.4

iv) display the column names of the dataset.

In [20]:
df.columns

Index(['TV', 'radio', 'newspaper', 'sales'], dtype='object')

v) display last three records from dataset.

In [21]:
df.tail(3)

        TV  radio  newspaper  sales
197  177.0    9.3        6.4   12.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   13.4

vi) display the information about the dataset.

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   TV         200 non-null    float64
 1   radio      200 non-null    float64
 2   newspaper  200 non-null    float64
 3   sales      200 non-null    float64
dtypes: float64(4)
memory usage: 6.4 KB

vii) display data types of each columns.

In [23]:
df.dtypes

TV           float64
radio        float64
newspaper    float64
sales        float64
dtype: object

viii) check for null values in the dataset and display the sum of null values inside the column.

In [26]:
df.isnull().sum()

TV           0
newspaper    0
sales        0
dtype: int64

ix) drop all null values.

x) drop a column 'radio' from a dataset and display first ten records.

In [33]:
df.drop(['radio'], axis=1, inplace=True,errors="ignore")
df.head(10)

      TV  newspaper  sales
0  230.1       69.2   22.1
1   44.5       45.1   10.4
2   17.2       69.3    9.3
3  151.5       58.5   18.5
4  180.8       58.4   12.9
5    8.7       75.0    7.2
6   57.5       23.5   11.8
7  120.2       11.6   13.2
8    8.6        1.0    4.8
9  199.8       21.2   10.6

 increase the sales by 10% and add a new column "updated_sales" in dataframe.

In [34]:
df['Updated_sales']=df['sales']*0.10

In [35]:
df

        TV  newspaper  sales  Updated_sales
0    230.1       69.2   22.1           2.21
1     44.5       45.1   10.4           1.04
2     17.2       69.3    9.3           0.93
3    151.5       58.5   18.5           1.85
4    180.8       58.4   12.9           1.29
..     ...        ...    ...            ...
195   38.2       13.8    7.6           0.76
196   94.2        8.1    9.7           0.97
197  177.0        6.4   12.8           1.28
198  283.6       66.2   25.5           2.55
199  232.1        8.7   13.4           1.34

[200 rows x 4 columns]

display shape of data.

In [37]:
df.shape

(200, 4)